In [17]:
import sqlite3
import pandas as pd
import numpy as np

In [18]:
connexion = sqlite3.connect("exemple.db")

In [19]:
df = pd.DataFrame({'col1': [1,2,3] , 'col2': [2,3,4]})

In [7]:
df

   col1  col2
0     1     2
1     2     3
2     3     4

In [23]:
df.to_sql('test_table' , connexion , if_exists='replace', index= False)

In [21]:
sql = ''' SELECT * FROM test_table '''

In [22]:
pd.read_sql(sql , connexion )

   col1  col2
0     1     2
1     2     3
2     3     4

In [26]:
def select(sql):
  return pd.read_sql(sql ,connexion)

In [27]:
select(sql)

   col1  col2
0     1     2
1     2     3
2     3     4

In [28]:
cur = connexion.cursor()